In [1]:
import pandas as pd
import numpy as np

DATA DESCRIPTION
```
file name -> Columns
quater-i.csv -> ['order_id', 'quantity', 'item_id', 'choice_description_id' 'item_price']
items.csv -> ['item_id', 'item_name']
```
Dataset Link - https://drive.google.com/drive/folders/1Z0kaFybvgFeczeUj4dldUnhTdloLqLsL?usp=share_link

In [23]:
items_path=r'F:\Python\datasets\items.csv'
q1_path=r"F:\Python\datasets\quarter-1.csv"
q2_path=r"F:\Python\datasets\quarter-2.csv"
q3_path=r"F:\Python\datasets\quarter-3.csv"

q1=pd.read_csv(q1_path)
q2=pd.read_csv(q2_path)
q3=pd.read_csv(q3_path)
items=pd.read_csv(items_path)

### `Q:1-5`
1. You are given three quater files, your job is to append these three files and make a single dataframe.
2. Have a index as Q-1 Q-2 Q-3 for respective quater files in the dataframe
3. Your are given a file items.csv which has item_id and item_name. Find out most sold items in each quarter.
4. Find out items which has made most revenue in each quarter.
5. Find out avg order price of each quarter.

***Note: item_price is given as str with $ sign, in earlier task you have converted this to rupees, here too first convert item_price field in rupees.***

In [24]:
#1+2
df1=pd.concat([q1,q2,q3],keys=["Q1","Q2","Q3"])
df1

        order_id quantity item_id choice_description_id item_price
Q1 0           1        1       1                     1     $3.39
   1           1        1       2                     2     $3.39
   2           2        2       4                     3    $16.98
   3           4        1       7                     6     $9.25
   4           6        1       9                     8     $8.75
...          ...      ...     ...                   ...        ...
Q2 2342     1829        1      23                    92    $11.25
   2343     1830        1      23                  1043    $11.25
   2344     1832        1      10                   116     $8.75
   2345     1832        1       8                     0     $4.45
   2346     1834        1      20                   515    $11.25

[4622 rows x 5 columns]

In [30]:
#3
#Your are given a file items.csv which has item_id and item_name. Find out most sold items in each quarter.
new_df=df1.reset_index().merge(items,on="item_id")
new_df.rename(columns={'level_0':'quarter'},inplace=True)
new_df.groupby(['quarter','item_name'],as_index=False)['quantity'].sum().sort_values('quantity',ascending=False).drop_duplicates(subset='quarter',keep='first')

   quarter     item_name  quantity
65      Q2  Chicken Bowl       394
17      Q1  Chicken Bowl       367

In [47]:
#4. Find out items which has made most revenue in each quarter.
#new_df['item_price'].dtype
#new_df["item_price"] = new_df.item_price.apply(lambda x: float(x[1:]))
#dtype(new_df["item_price"])
new_df["total_item_price"] = new_df["item_price"] * new_df["quantity"]
new_df.groupby(["quarter", "item_name"], as_index = False)["total_item_price"].sum().sort_values("total_item_price", ascending=False).drop_duplicates("quarter", keep="first")

   quarter     item_name  total_item_price
65      Q2  Chicken Bowl           4192.25
17      Q1  Chicken Bowl           3852.38

In [49]:
#5. Find out avg order price of each quarter.
new_df.groupby(['quarter','order_id'],as_index=False)['total_item_price'].sum().groupby('quarter',as_index=False)['total_item_price'].mean()

  quarter  total_item_price
0      Q1         13.809488
1      Q2         13.279828